Управление_по_целям_и_KPI/src/DataProcessors/KPI_ЗаполнениеСтруктурыФилиала/KPI_ЗаполнениеСтруктурыФилиала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>KPI_ЗаполнениеСтруктурыФилиала</name>
</mdclass:DataProcessor>

Управление_по_целям_и_KPI/src/Documents/KPI_ПриказОНазначенииНаДолжность/KPI_ПриказОНазначенииНаДолжность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ПриказОНазначенииНаДолжность</name>
  <registerRecords>InformationRegister.KPI_ГрафикиРаботыСотрудников</registerRecords>
  <registerRecords>InformationRegister.KPI_ПлановыеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.KPI_Квалификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.KPI_ГрафикиРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПользователяИБ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеНачисления</name>
    <attributes>
      <name>СтруктураКомпании</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Начисление</name>
      <type>
        <types>ChartOfCalculationTypesRef.KPI_Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Catalogs/KPI_СтруктураКомпании/KPI_СтруктураКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_СтруктураКомпании</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.KPI_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.KPI_Филиалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РолиОбъектаУправления</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/DataProcessors/KPI_ЗаполнениеСтруктурыФилиала/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СоздатьСтруктуруФилиала(Команда)
	
	СоздатьСтруктуруКомпанииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтруктуруКомпанииНаСервере()
	
	Дерево = РеквизитФормыВЗначение("ДеревоКомпании");
	ЕстьОшибки = Ложь;
	
	ЕстьПользовательАдминистратор = Ложь;
	ЕстьПользовательКадровик      = Ложь;
	
	НачатьТранзакцию(); 
	Попытка	
		СформироватьДокументНазначения(Дерево.Строки,НачалоДня(ТекущаяДата()));		
	Исключение
		ЕстьОшибки = Истина;
	КонецПопытки;
		
	Если Не ЕстьПользовательАдминистратор Тогда
		ЕстьОшибки = Истина;
		KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Не указан пользователь с административными правами.");
	КонецЕсли;
	
	Если Не ЕстьПользовательКадровик Тогда 
		ЕстьОшибки = Истина;
		KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Не указан пользователь с правами кадровика.");
	КонецЕсли;
		
	Если ЕстьОшибки Тогда
		ОтменитьТранзакцию();
		KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Не удалось сформировать структуру компании.");	
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументНазначения(СтрокиДерева,ДатаСтаршегоДокумента,РодительСтруктуры = Неопределено)
	
	Если НЕ СтрокиДерева.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПриказНазначения      = Документы.KPI_ПриказОНазначенииНаДолжность.СоздатьДокумент();
	ДатаСтаршегоДокумента = ДатаСтаршегоДокумента + 1;
	ПриказНазначения.Дата = ДатаСтаршегоДокумента;
	
	Для Каждого Стр из СтрокиДерева Цикл
		
		СтруктураКомпании              = Справочники.KPI_СтруктураКомпании.СоздатьЭлемент();
		СтруктураКомпании.Филиал       = ЭтаФорма.Филиал;
		СтруктураКомпании.Должность    = Стр.Должность;
		СтруктураКомпании.Родитель     = РодительСтруктуры;
		РольПользователь = СтруктураКомпании.РолиОбъектаУправления.Добавить();
		РольПользователь.Имя = "KPI_Пользователь";
		Если НЕ Стр.ОсновнаяРоль = РольПользователь.Имя И ЗначениеЗаполнено(Стр.ОсновнаяРоль) Тогда
			ОсновнаяРоль = СтруктураКомпании.РолиОбъектаУправления.Добавить();
			ОсновнаяРоль.Имя = Стр.ОсновнаяРоль;
		КонецЕсли;
		
		Если Стр.ОсновнаяРоль = "KPI_Администратор" Тогда
			ЕстьПользовательАдминистратор = Истина;
		ИначеЕсли Стр.ОсновнаяРоль = "KPI_Кадровик" Тогда
			ЕстьПользовательКадровик = Истина;
		ИначеЕсли Стр.ОсновнаяРоль = "ПолныеПрава" Тогда
			ЕстьПользовательАдминистратор = Истина;
			ЕстьПользовательКадровик      = Истина;
		КонецЕсли;
		
		СтруктураКомпании.Записать();
		
		СтрокаНазначения = ПриказНазначения.Сотрудники.Добавить();
		СтрокаНазначения.ФизЛицо = Стр.ФизЛицо;
		СтрокаНазначения.СтруктураКомпании = СтруктураКомпании.Ссылка;
		СтрокаНазначения.ГрафикРаботы = Стр.ГрафикРаботы;
		СтрокаНазначения.Квалификация = Стр.Квалификация;
		
		СформироватьДокументНазначения(Стр.Строки,ДатаСтаршегоДокумента,СтруктураКомпании.Ссылка)
		
	КонецЦикла;
	
	ПриказНазначения.ЗаполнитьПлановыеНачисления();
	ПриказНазначения.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоКомпанииОсновнаяРольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокРолей = KPI_ИнтерфейсВызовСервера.РолиKPI();
	ВыбраннаяРоль = СписокРолей.ВыбратьЭлемент();
	Если НЕ ВыбраннаяРоль = Неопределено Тогда
		Элементы.ДеревоКомпании.ТекущиеДанные.ОсновнаяРоль = ВыбраннаяРоль.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПервоначальноеЗаполнение") Тогда
		Заголовок = "Первоначальное заполнение филиала";
		ЕстьПользовательПолныеПрава = Ложь;
		РольПолныеПрава    = Метаданные.Роли.ПолныеПрава;
		ВсеПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
		Для Каждого ПользовательИБ из ВсеПользователи Цикл
			Если ПользовательИБ.Роли.Содержит(РольПолныеПрава) Тогда
				 ЕстьПользовательПолныеПрава = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьПользовательПолныеПрава Тогда
			Отказ = Истина;
		КонецЕсли;
		
	Иначе 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
